Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase
The embedded database in a Document

Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.BeginTransaction(Autodesk.Navisworks.Api.Data.DatabaseChangedAction)
Begin a transaction.
action:
Determines which action should do after commit transaction, DatabaseChangedAction
Returns:
If success return NavisworksTransaction, if failed, return null
Throws System.InvalidOperationException:
Database element can't be created
Throws Autodesk.Navisworks.Api.Data.DatabaseException:
Database exception

Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.Changed
Occurs when the DocumentDatabase has changed

Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.Changing
Occurs when the DocumentDatabase is about to change

Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.Dispose


Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.Dispose(System.Boolean)


Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.EnableTableUndoable(System.String)
Enable table to undoable or redoable.
Throws System.InvalidOperationException:
Database element can't be created
Throws Autodesk.Navisworks.Api.Data.DatabaseException:
Database exception

Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.ExistLiveTransaction
If is in a transaction.

Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.Loaded
Occurs when entirely new database loaded from file.

Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.op_Implicit(Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase)~Autodesk.Navisworks.Api.Data.NavisworksConnection
Conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.ToNavisworksConnection
Explicit form of conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.TransactionBeginning
Occurs when a database transaction is about to begins, before any of the edits in the transaction take place.

Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.TransactionBegun
Occurs when a database transaction begins, before any of the edits in the transaction take place.

Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.TransactionCommitting
Occurs when a database transaction has completed all edits and will commit.

Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.TransactionRollingBack
Occurs when a database transaction has completed all edits and happen error, but will rollback.

Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.Unloading
Current database about to be unloaded (about to change file or exit).

Autodesk.Navisworks.Api.DocumentParts.DocumentDatabase.Value
The value of the NavisworksConnection of embedded database in the document